# Operaciones

Hay muchas operaciones con Pandas que son realmente útiles.

In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
# Cuando tenemos dataframes grandes, se usa head() para mostrar sólo las primeras filas
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# tail muestra sólo las últimas filas (por defecto 5)
df.tail(1)

   col1  col2 col3
3     4   444  xyz

## Información acerca de valores únicos

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Seleccionando datos

In [13]:
# Recordatorio: 
# Seleccionando datos de un DataFrame usando criterios múltiples

newdf = df[(df['col1']>2) & (df['col2']==444)]

In [14]:
newdf

   col1  col2 col3
3     4   444  xyz

## Función apply

In [15]:
df['col1'].sum()

10

In [16]:
def times2(x):
    return x*2

In [17]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [18]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [19]:
# Apply es muy útil y puede ser usado también con expresiones lambda

df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [20]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [21]:
# También se puede usar con funciones predeterminadas como len
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## Otras operaciones:

** Eliminar columnas permanentemente **

In [22]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [23]:
df.drop('col1',axis=1) # Para que sea permanente inplace=True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
# Si queremos eliminar una columna permanentemente también se puede usar:
del df['col1']

In [27]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Obtener los nombres de las columnas y los índices: **

In [28]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Ordenar un DataFrame:**

In [30]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [31]:
df.sort_values('col2') #inplace=False por defecto

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Rellenar valores NaN con algo más: **

In [32]:
import numpy as np

In [33]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

** Hallar valores NULL o verificarlos**

In [34]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [35]:
df.fillna('VALOR') # inplace=False por defecto

    col1   col2 col3
0      1  VALOR  abc
1      2    555  def
2      3    666  ghi
3  VALOR    444  xyz

In [36]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [37]:
# Eliminar filas con valores NaN
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

** Tablas pivote**

In [38]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['uno','uno','dos','dos','uno','uno'],
       'C':['categoria 1','categoria 2','categoria 1','categoria 2','categoria 1','categoria 2'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [39]:
df

     A    B            C  D
0  foo  uno  categoria 1  1
1  foo  uno  categoria 2  3
2  foo  dos  categoria 1  2
3  bar  dos  categoria 2  5
4  bar  uno  categoria 1  4
5  bar  uno  categoria 2  1

In [40]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C        categoria 1  categoria 2
A   B
bar dos          NaN          5.0
    uno          4.0          1.0
foo dos          2.0          NaN
    uno          1.0          3.0

Otro ejemplo:

In [41]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [42]:
table = df.pivot_table(values='D', index=['A', 'B'],
                     columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0